## Usecase of pandas
- Data Cleaning
- Data Analysis
- Data Transformation
- Data Visualization (Basic Level)
- Data Aggregation
- Data Handling
- Data Filtering & Selection
- Time Series analysis

In [53]:
# Series
# A series is a one dimentional labelled array capable of holding any data type. the axis are collectively called the index

In [54]:
import numpy as np
import pandas as pd

In [55]:
labels = ['a','b','c']
my_lst = [10,20,30]
arr = np.array([10,20,30])
dic = {1:10,2:20,3:30}

In [56]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [57]:
pd.Series(dic)

1    10
2    20
3    30
dtype: int64

In [58]:
pd.Series(my_lst,index=labels)

a    10
b    20
c    30
dtype: int64

# DataFrames
- Creating dataframe
- Selection and indexing of cols 
- Creating new col 
- Removing cols
- selecting rows
- selecting subsets of rows and cols
- conditional selection

In [59]:
data = {
    "Name":['Shivam','Shahi','Rohan','Raghav','Ram'],
    "Age": [20,23,34,56,78],
    "City":["New York","Paris","Berlin","London","India"],
    "Salary":[65000,70000,62000,85000,np.nan]
}

df = pd.DataFrame(data)

In [60]:
df

     Name  Age      City   Salary
0  Shivam   20  New York  65000.0
1   Shahi   23     Paris  70000.0
2   Rohan   34    Berlin  62000.0
3  Raghav   56    London  85000.0
4     Ram   78     India      NaN

In [61]:
df['Age'].astype(float)

0    20.0
1    23.0
2    34.0
3    56.0
4    78.0
Name: Age, dtype: float64

In [62]:
# selection of cols

df[['Age','Name']]

   Age    Name
0   20  Shivam
1   23   Shahi
2   34   Rohan
3   56  Raghav
4   78     Ram

In [63]:
df['Name']

0    Shivam
1     Shahi
2     Rohan
3    Raghav
4       Ram
Name: Name, dtype: object

In [64]:
# creating new cols

df['Designation'] = ['Data Scientist', "Devops","AI Engineer","Data Analyst","Doctor"]

In [65]:
df

     Name  Age      City   Salary     Designation
0  Shivam   20  New York  65000.0  Data Scientist
1   Shahi   23     Paris  70000.0          Devops
2   Rohan   34    Berlin  62000.0     AI Engineer
3  Raghav   56    London  85000.0    Data Analyst
4     Ram   78     India      NaN          Doctor

In [66]:
# removing col

df = df.drop('Designation',axis=1)

In [67]:
df

     Name  Age      City   Salary
0  Shivam   20  New York  65000.0
1   Shahi   23     Paris  70000.0
2   Rohan   34    Berlin  62000.0
3  Raghav   56    London  85000.0
4     Ram   78     India      NaN

In [68]:
# selection row
df

     Name  Age      City   Salary
0  Shivam   20  New York  65000.0
1   Shahi   23     Paris  70000.0
2   Rohan   34    Berlin  62000.0
3  Raghav   56    London  85000.0
4     Ram   78     India      NaN

In [69]:
df.loc[4]

Name        Ram
Age          78
City      India
Salary      NaN
Name: 4, dtype: object

In [70]:
df.iloc[4]

Name        Ram
Age          78
City      India
Salary      NaN
Name: 4, dtype: object

In [71]:
# selecting subjects of rows and cols

df.loc[0][['City','Name']]

City    New York
Name      Shivam
Name: 0, dtype: object

In [72]:
df

     Name  Age      City   Salary
0  Shivam   20  New York  65000.0
1   Shahi   23     Paris  70000.0
2   Rohan   34    Berlin  62000.0
3  Raghav   56    London  85000.0
4     Ram   78     India      NaN

In [73]:
df.loc[[2,3]][["Name",'Age']]

     Name  Age
2   Rohan   34
3  Raghav   56

In [74]:
# conditional selection

df2 = df.copy()

In [75]:
df2.fillna(50000,inplace=True)

In [76]:
# people whose age is above 30

df[df['Age']>30]

     Name  Age    City   Salary
2   Rohan   34  Berlin  62000.0
3  Raghav   56  London  85000.0
4     Ram   78   India      NaN

#### MISSING DATA

In [77]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [10, np.nan, 30, 40, 50],
    'C': [100, 200, 300, np.nan, 500]
}

df3 = pd.DataFrame(data)

In [78]:
df3

     A     B      C
0  1.0  10.0  100.0
1  2.0   NaN  200.0
2  NaN  30.0  300.0
3  4.0  40.0    NaN
4  5.0  50.0  500.0

In [79]:
df3.isna().sum()

A    1
B    1
C    1
dtype: int64

In [80]:
df3.isna().any()

A    True
B    True
C    True
dtype: bool

In [81]:
# removing missing value

df3.dropna()

     A     B      C
0  1.0  10.0  100.0
4  5.0  50.0  500.0

In [82]:
df3.dropna(thresh=3)

     A     B      C
0  1.0  10.0  100.0
4  5.0  50.0  500.0

In [83]:
# Filling the missing data

In [84]:

df3

     A     B      C
0  1.0  10.0  100.0
1  2.0   NaN  200.0
2  NaN  30.0  300.0
3  4.0  40.0    NaN
4  5.0  50.0  500.0

In [85]:
# filling all the missing value with 0 

df3.fillna(0)

     A     B      C
0  1.0  10.0  100.0
1  2.0   0.0  200.0
2  0.0  30.0  300.0
3  4.0  40.0    0.0
4  5.0  50.0  500.0

In [86]:
df3["D"] = [5,4,3,np.nan,np.nan]

In [87]:
df3

     A     B      C    D
0  1.0  10.0  100.0  5.0
1  2.0   NaN  200.0  4.0
2  NaN  30.0  300.0  3.0
3  4.0  40.0    NaN  NaN
4  5.0  50.0  500.0  NaN

In [88]:
# filling different values for each cols

values ={"A":0,"B":100,"C":300,"D":400}
df3.fillna(value=values)

     A      B      C      D
0  1.0   10.0  100.0    5.0
1  2.0  100.0  200.0    4.0
2  0.0   30.0  300.0    3.0
3  4.0   40.0  300.0  400.0
4  5.0   50.0  500.0  400.0

In [89]:
df3.fillna(df3.mean())

     A     B      C    D
0  1.0  10.0  100.0  5.0
1  2.0  32.5  200.0  4.0
2  3.0  30.0  300.0  3.0
3  4.0  40.0  275.0  4.0
4  5.0  50.0  500.0  4.0

In [90]:
# merging , joining, concatinatin

In [91]:
import pandas as pd

df1 = pd.DataFrame({
    'emp_id': [101, 102, 103, 104],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'dept': ['HR', 'IT', 'Finance', 'Marketing']
})


df2 = pd.DataFrame({
    'emp_id': [103, 104, 105, 106],
    'salary': [70000, 80000, 60000, 50000],
    'location': ['Delhi', 'Mumbai', 'Bangalore', 'Chennai']
})

In [92]:
df1

   emp_id     name       dept
0     101    Alice         HR
1     102      Bob         IT
2     103  Charlie    Finance
3     104    David  Marketing

In [93]:
df2

   emp_id  salary   location
0     103   70000      Delhi
1     104   80000     Mumbai
2     105   60000  Bangalore
3     106   50000    Chennai

In [94]:
# MERGING 
pd.merge(df1,df2, on='emp_id',how= "outer")

   emp_id     name       dept   salary   location
0     101    Alice         HR      NaN        NaN
1     102      Bob         IT      NaN        NaN
2     103  Charlie    Finance  70000.0      Delhi
3     104    David  Marketing  80000.0     Mumbai
4     105      NaN        NaN  60000.0  Bangalore
5     106      NaN        NaN  50000.0    Chennai

Capstone Project

In [95]:
df = pd.read_csv('Countries.csv')

In [96]:
df.shape

(194, 64)

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 194 entries, 0 to 193
Data columns (total 64 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   country                                  194 non-null    object
 1   country_long                             194 non-null    object
 2   currency                                 194 non-null    object
 3   capital_city                             194 non-null    object
 4   region                                   194 non-null    object
 5   continent                                194 non-null    object
 6   demonym                                  194 non-null    object
 7   latitude                                 194 non-null    float64
 8   longitude                                194 non-null    float64
 9   agricultural_land                        193 non-null    float64
 10  forest_area                              194 non-null    float64
 11  land_area                                194 non-null    float64
 12  rural_land                               194 non-null    float64
 13  urban_land                               194 non-null    float64
 14  central_government_debt_pct_gdp          120 non-null    float64
 15  expense_pct_gdp                          156 non-null    float64
 16  gdp                                      193 non-null    float64
 17  inflation                                184 non-null    float64
 18  self_employed_pct                        179 non-null    float64
 19  tax_revenue_pct_gdp                      159 non-null    float64
 20  unemployment_pct                         179 non-null    float64
 21  vulnerable_employment_pct                179 non-null    float64
 22  electricity_access_pct                   194 non-null    float64
 23  alternative_nuclear_energy_pct           138 non-null    float64
 24  electricty_production_coal_pct           138 non-null    float64
 25  electricty_production_hydroelectric_pct  138 non-null    float64
 26  electricty_production_gas_pct            138 non-null    float64
 27  electricty_production_nuclear_pct        138 non-null    float64
 28  electricty_production_oil_pct            138 non-null    float64
 29  electricty_production_renewable_pct      138 non-null    float64
 30  energy_imports_pct                       138 non-null    float64
 31  fossil_energy_consumption_pct            168 non-null    float64
 32  renewable_energy_consumption_pct         192 non-null    float64
 33  co2_emissions                            191 non-null    float64
 34  methane_emissions                        191 non-null    float64
 35  nitrous_oxide_emissions                  191 non-null    float64
 36  greenhouse_other_emissions               184 non-null    float64
 37  urban_population_under_5m                194 non-null    float64
 38  health_expenditure_pct_gdp               190 non-null    float64
 39  health_expenditure_capita                190 non-null    float64
 40  hospital_beds                            192 non-null    float64
 41  hiv_incidence                            133 non-null    float64
 42  suicide_rate                             183 non-null    float64
 43  armed_forces                             174 non-null    float64
 44  internally_displaced_persons             73 non-null     float64
 45  military_expenditure_pct_gdp             163 non-null    float64
 46  birth_rate                               194 non-null    float64
 47  death_rate                               194 non-null    float64
 48  fertility_rate                           193 non-null    float64
 49  internet_pct                             194 non-null    float64
 50  life_expectancy                          191 non-null    float64
 51  net_migration                            194 non-null    int64
 52  population_female                        194 non-null    int64
 53  population_male                          194 non-null    int64
 54  population                               194 non-null    int64
 55  women_parliament_seats_pct               193 non-null    float64
 56  rural_population                         194 non-null    int64
 57  urban_population                         194 non-null    int64
 58  press                                    194 non-null    float64
 59  democracy_score                          194 non-null    float64
 60  democracy_type                           194 non-null    object
 61  median_age                               194 non-null    float64
 62  political_leader                         187 non-null    object
 63  title                                    187 non-null    object
dtypes: float64(48), int64(6), object(10)
memory usage: 97.1+ KB

In [98]:
df.isnull().sum()

country             0
country_long        0
currency            0
capital_city        0
region              0
                   ..
democracy_score     0
democracy_type      0
median_age          0
political_leader    7
title               7
Length: 64, dtype: int64

In [99]:
df.describe()

,latitude,longitude,agricultural_land,forest_area,land_area,rural_land,urban_land,central_government_debt_pct_gdp,expense_pct_gdp,gdp,...,net_migration,population_female,population_male,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,median_age
count,194.000000,194.000000,1.930000e+02,1.940000e+02,1.940000e+02,1.940000e+02,194.000000,120.000000,156.000000,1.930000e+02,...,194.000000,1.940000e+02,1.940000e+02,1.940000e+02,193.000000,1.940000e+02,1.940000e+02,194.000000,194.000000,194.000000
mean,18.975601,22.027491,2.454551e+05,2.086784e+05,6.675087e+05,6.563711e+05,9777.116531,66.759366,30.051403,5.144851e+11,...,-51.407216,2.028316e+07,2.050572e+07,4.078888e+07,25.022994,1.763322e+07,2.315566e+07,2.539330,4.644536,25.661856
std,23.876225,66.396389,6.356268e+05,7.824926e+05,1.837107e+06,1.811169e+06,42301.458421,71.806247,26.740880,2.307148e+12,...,94525.968598,7.258941e+07,7.607158e+07,1.486470e+08,12.671044,7.664187e+07,7.940393e+07,1.800128,2.818297,9.415569
min,-41.000000,-175.000000,4.000000e+00,0.000000e+00,2.027000e+00,3.495450e-02,0.000000,0.000000,0.000267,6.034940e+07,...,-525116.000000,5.513000e+03,5.799000e+03,1.131200e+04,0.000000,0.000000e+00,5.717000e+03,0.000000,0.000000,10.500000
25%,4.000000,-5.000000,6.464000e+03,3.331775e+03,2.355250e+04,2.186562e+04,359.618250,31.951300,18.371875,1.181390e+10,...,-12242.250000,1.036218e+06,1.044902e+06,2.106358e+06,15.384600,5.896640e+05,1.222244e+06,1.525000,2.722500,16.950000
50%,16.583333,21.500000,3.872780e+04,2.528925e+04,1.203750e+05,1.159945e+05,1645.170000,55.426850,27.337750,4.115390e+10,...,-970.000000,4.502713e+06,4.450049e+06,9.125614e+06,25.252500,2.512382e+06,4.508837e+06,2.400000,5.050000,24.950000
75%,40.000000,50.162500,2.150000e+05,1.236735e+05,5.237000e+05,4.911505e+05,4054.022500,79.539300,35.083500,2.519450e+11,...,2904.250000,1.526606e+07,1.478872e+07,3.031361e+07,33.636400,1.133354e+07,1.621355e+07,2.925000,6.967500,34.050000
max,65.000000,178.000000,5.285080e+06,8.153120e+06,1.637690e+07,1.622420e+07,522345.000000,687.994000,310.443000,2.546270e+13,...,561580.000000,6.915285e+08,7.311805e+08,1.417173e+09,61.250000,9.088048e+08,8.975784e+08,10.000000,9.870000,50.500000

In [104]:
df.head()

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,...,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
0,Afghanistan,Islamic State of Afghanistan,Afghan afghani,Kabul,Southern Asia,Asia,Afghan,33.0,65.0,383560.0,...,41128771,27.01610,30181937,10946834,2.14,2.97,Authoritarian,12.9,Ashraf Ghani,President
1,Albania,Republic of Albania,Albanian lek,Tirana,Southern Europe,Europe,Albanian,41.0,20.0,11655.5,...,2775634,35.71430,1004807,1770827,2.62,5.98,Hybrid regime,33.7,Edi Rama,Prime Minister
2,Algeria,People's Democratic Republic of Algeria,Algerian dinar,Algiers,Northern Africa,Africa,Algerian,28.0,3.0,413588.0,...,44903225,8.10811,11328186,33575039,1.71,3.50,Authoritarian,24.0,Abdelmadjid Tebboune,President
3,Andorra,Principality of Andorra,Euro,Andorra la Vella,Southern Europe,Europe,Andorran,42.5,1.5,187.2,...,79824,46.42860,9730,70094,3.17,0.00,Unknown,38.9,Xavier Espot Zamora,Head of Government
4,Angola,People's Republic of Angola,Angolan kwanza,Luanda,Middle Africa,Africa,Angolan,-12.5,18.5,569525.0,...,35588987,33.63640,11359649,24229338,2.24,3.62,Authoritarian,12.4,Joo Loureno,President

In [102]:
df[df['population'] == df['population'].max()]['country']

75    India
Name: country, dtype: object

In [106]:
# what is the capital of the country with the hightest population
df[df['population'] == df['population'].max()]['capital_city']

75    New Delhi
Name: capital_city, dtype: object

In [107]:
# which country has the least population
df[df['population'] == df['population'].min()]['country']

179    Tuvalu
Name: country, dtype: object

In [108]:
# what is the capital of the country with least population

df[df['population'] == df['population'].min()]['capital_city']

179    Funafuti
Name: capital_city, dtype: object

In [109]:
df.head()

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,...,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
0,Afghanistan,Islamic State of Afghanistan,Afghan afghani,Kabul,Southern Asia,Asia,Afghan,33.0,65.0,383560.0,...,41128771,27.01610,30181937,10946834,2.14,2.97,Authoritarian,12.9,Ashraf Ghani,President
1,Albania,Republic of Albania,Albanian lek,Tirana,Southern Europe,Europe,Albanian,41.0,20.0,11655.5,...,2775634,35.71430,1004807,1770827,2.62,5.98,Hybrid regime,33.7,Edi Rama,Prime Minister
2,Algeria,People's Democratic Republic of Algeria,Algerian dinar,Algiers,Northern Africa,Africa,Algerian,28.0,3.0,413588.0,...,44903225,8.10811,11328186,33575039,1.71,3.50,Authoritarian,24.0,Abdelmadjid Tebboune,President
3,Andorra,Principality of Andorra,Euro,Andorra la Vella,Southern Europe,Europe,Andorran,42.5,1.5,187.2,...,79824,46.42860,9730,70094,3.17,0.00,Unknown,38.9,Xavier Espot Zamora,Head of Government
4,Angola,People's Republic of Angola,Angolan kwanza,Luanda,Middle Africa,Africa,Angolan,-12.5,18.5,569525.0,...,35588987,33.63640,11359649,24229338,2.24,3.62,Authoritarian,12.4,Joo Loureno,President

In [115]:
# Find the top 5 countries with highest democratic score
top_5 = df.sort_values(by= 'democracy_score', ascending= False, ignore_index= True)

In [116]:
top_5.loc[0:5]

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,...,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
0,Norway,Kingdom of Norway,Norwegian krone,Oslo,Northern Europe,Europe,Norwegian,62.0,10.0,9859.62,...,5457127,44.9704,891476,4565651,10.00,9.87,Full democracy,35.6,Erna Solberg,Prime Minister
1,Iceland,Republic of Iceland,Iceland krona,Reykjavk,Northern Europe,Europe,Icelander,65.0,-18.0,18720.00,...,381900,47.6190,22945,358955,5.32,9.58,Full democracy,32.1,Katrn Jakobsdttir,Prime Minister
2,Sweden,Kingdom of Sweden,Swedish krona,Stockholm,Northern Europe,Europe,Swedish,62.0,15.0,30055.40,...,10486941,46.4183,1206837,9280104,9.41,9.39,Full democracy,35.6,Stefan Lfven,Prime Minister
3,New Zealand,New Zealand,New Zealand dollar,Wellington,Australia and New Zealand,Oceania,New Zealander,-41.0,174.0,101540.00,...,5124100,50.4202,672077,4452023,7.27,9.26,Full democracy,32.8,Jacinda Ardern,Prime Minister
4,Denmark,Kingdom of Denmark,Danish krone,Copenhagen,Northern Europe,Europe,Danish,56.0,10.0,26199.90,...,5903037,43.5754,686700,5216337,7.92,9.22,Full democracy,37.2,Mette Frederiksen,Prime Minister
5,Ireland,Ireland,Euro,Dublin,Northern Europe,Europe,Irish,53.0,-8.0,45120.00,...,5086988,23.1250,1822006,3264982,5.21,9.15,Full democracy,33.9,Leo Varadkar,Taoiseach

In [121]:
# How many total regions are there
total_region = len(df['region'].value_counts())

total_region

22

In [125]:
# how many countries llie in eastern europe region
df['region'].value_counts()['Eastern Europe']

np.int64(10)

In [128]:
df[df['region']== 'Eastern Europe']['country']

14             Belarus
24            Bulgaria
43      Czech Republic
73             Hungary
111            Moldova
136             Poland
139            Romania
140             Russia
151    Slovak Republic
181            Ukraine
Name: country, dtype: object

In [137]:
# who is the political leader of the 2nd highest populated country

df[df['population'] == df['population'].nlargest(2).iloc[1]]

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,...,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
34,China,People's Republic of China,Chinese yuan,Beijing,Eastern Asia,Asia,Chinese,35.0,105.0,5285080.0,...,1412175000,24.9412,514596570,897578430,0.99,3.32,Authoritarian,34.5,Xi Jinping,General Secretary of the Communist Party